### [DataFrame 연산 - 2]
 - 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
 - DataFrame과 DataFrame 연산 수행

In [1]:
import pandas as pd
import numpy as np

In [3]:
data = {'A':[98,78,100,52], 'B':[91,70,10,50]}

In [4]:
# [3] Dict ==> DF
DF1 = pd.DataFrame(data)
DF2 = DF1/4

In [5]:
# [4] 연산수행
 # - 산술연산
DF1 - DF2

      A      B
0  73.5  68.25
1  58.5  52.50
2  75.0   7.50
3  39.0  37.50

In [7]:
DF1 * DF2

        A        B
0  2401.0  2070.25
1  1521.0  1225.00
2  2500.0    25.00
3   676.0   625.00

In [6]:
DF1 <= DF2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [12]:
# [5] 연산수행 => DataFrame과 Series
# 산술연산
# - A 컬럼만 추출
SR1 = DF1.A
SR1, SR1.index
# DF1.A + DF2

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
 RangeIndex(start=0, stop=4, step=1))

In [11]:
DF2.index, DF2.columns

(RangeIndex(start=0, stop=4, step=1), Index(['A', 'B'], dtype='object'))

In [13]:
DF2 + SR1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [18]:
# [방법1]
# SR -> DF 변환
SRDF = SR1.to_frame()
DF1 + SRDF

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [27]:
DF1.columns=[0,1]
DF1.T

    0   1    2   3
0  98  78  100  52
1  91  70   10  50

In [28]:
SR1, SR1+DF1.T

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
      0    1    2    3
 0  196  156  200  104
 1  189  148  110  102)